#include <iostream>
#include <fstream>
#include <string>

using namespace std;

void menu_display()
{
	cout << "Сортировка и поиск данных в массивах с использованием индексов-массивов" << endl;
	cout << "Выбранная структура данных: Расписание занятий (название занятия, дата и время проведения занятия, приоритет участия в занятии и пр.)." << endl;
	cout << "Авторы:" << endl;
	cout << "Фролов Б. В." << endl;
	cout << "Авторы:" << endl;
	cout << "Авторы:" << endl;
	cout << "Авторы:" << endl;
	cout << "Программа умеет: сортировать массивы по различным полям, вводить и выводить данные выбранной структуры" << endl;
	cout << "Выберите опцию (для выбора опции введите ее номер):" << endl;
	cout << "1 - Ввод данных с клавиатуры" << endl;
	cout << "2 - Вывод данных (записей из массива) на экран в порядке их ввода в массив." << endl;
	cout << "3 - Вывод данных (записей из массива) в текстовый файл в порядке их ввода в массив" << endl;
	cout << "4 - Ввод данных в массив (записей) из текстового файла выбранного формата" << endl;
	cout << "5 - Вывод элементов массива (записей) на экран в порядке сортировки в индексах по возрастанию значений ключевых полей." << endl;
	cout << "6 - Вывод элементов массива (записей) на экран в порядке сортировки в индексах по убыванию значений ключевых полей." << endl;
	cout << "7 - Поиск элементов по значениям ключевых атрибутов в построенных индексах." << endl;
	cout << "8 - Редактирования записей в массиве с возможностью изменения значений атрибутов, по которым выполнена индексация записей массива." << endl;
	cout << "9 - Удаления записи с заданным значением ключевого атрибута из массива с соответствующим изменением индекса." << endl;
	cout << "2. Exit" << endl;
}

int main()
{

}
